Переход на мировые координаты
================================

Описание проблемы
-----------------
Сложность работы с текущей реализацией игровой карты и затруднение продолжения разработки без изменения подхода к её использованию, привело к желанию упростить её использование.
Текущая реализация состоит из массива локаций и массива тайлов внутри каждой локации, поэтому любые операции с координатами превращаются в горожение большого количества обращений к индексам.
Большой трудностью является то, что тайлы соседних локаций никак не доступны друг для друга и для продвинутой обработки, требуется использование большого количества условий, реализующих, по сути, одно и тоже.
Проблемой для производительности является использование минимум 4х вложенных циклов для операций над всеми тайлами.

Решение
--------
Решением вышеперечисленных проблем выбрано использование абстрактных мировых координат для всех операций с тайлами. Началом координат выступает левый верхний угол, от которого вправо и вниз идут две мировых оси.
При обращении по мировой координате к конкретному тайлу, она автоматически перессчитывается на глобальные и локальные координаты.
Такой подход решает многие проблемы разработки, но ставит новые вопросы, в частности, реализацию поиска пути. Для него было выбрано следующее решение:
Подготовить мировую карту зон доступности, где каждая зона доступности будет знать расположенные в ней тайлы. Глобальный поиск осуществлять по графу мировых зон доступности, 
а локальный поиск по содержимому этих зон. В таком случае, можно сильно сэкономить в опрациях и рассчётах при рассчете пути, при достаточно удобной реализации работы с координатами.
